from random import randint
lst = [randint(-30, 70) for i in range(10)]
'''
Вывести срез с 3 включительно елемента до 6 включительно.
'''
print(lst[2:6])
